src/cf/Documents/ДокументСписокНарушителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДокументСписокНарушителей</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отдел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияПрохода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПрохода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/НаправленияПрохода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияПрохода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ДокументСписокНарушителей/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы      

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ТабличнаяЧасть.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналСобытийСрезПоследних.ОбъектДоступа КАК Объект,
	               |	ЖурналСобытийСрезПоследних.Направление КАК Направление,
	               |	ЖурналСобытийСрезПоследних.ВремяСобытия КАК ВремяСобытия
	               |ПОМЕСТИТЬ Сотрудники
	               |ИЗ
	               |	РегистрСведений.ЖурналСобытий.СрезПоследних(
	               |			,
	               |			ОбъектДоступа.Отдел = &Отдел
	               |				И Направление = &НаправлениеВход
	               |				И ВремяСобытия > &ВремяВход
	               |				И ДатаСобытия = &ДатаДокумента) КАК ЖурналСобытийСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЖурналСобытийСрезПоследних.ОбъектДоступа,
	               |	ЖурналСобытийСрезПоследних.Направление,
	               |	ЖурналСобытийСрезПоследних.ВремяСобытия
	               |ИЗ
	               |	РегистрСведений.ЖурналСобытий.СрезПоследних(
	               |			,
	               |			ОбъектДоступа.Отдел = &Отдел
	               |				И Направление = &НаправлениеВыход
	               |				И ВремяСобытия < &ВремяВыход
	               |				И ДатаСобытия = &ДатаДокумента) КАК ЖурналСобытийСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Сотрудники.Объект КАК Объект,
	               |	Сотрудники.Направление КАК Направление,
	               |	Сотрудники.ВремяСобытия КАК ВремяСобытия
	               |ИЗ
	               |	Сотрудники КАК Сотрудники
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Сотрудники.Объект,
	               |	Сотрудники.Направление,
	               |	Сотрудники.ВремяСобытия";
	
	Запрос.УстановитьПараметр("ВремяВход",  Дата("01.01.0001 8:00:00"));
	Запрос.УстановитьПараметр("ВремяВыход", Дата("01.01.0001 17:00:00"));
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("НаправлениеВход", Перечисления.НаправленияПрохода.Вход);
	Запрос.УстановитьПараметр("НаправлениеВыход", Перечисления.НаправленияПрохода.Выход);
	Запрос.УстановитьПараметр("Отдел",            Объект.Отдел);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();                                                       
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
